src/DataProcessors/СозданиеПлановыхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>СозданиеПлановыхОпераций</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Documents/ПлановаяОперация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПлановаяОперация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПлановыеДвижения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/СозданиеПлановыхОпераций/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура СоздатьДокументы(Команда)
	СоздатьДокументыНаСервере();
КонецПроцедуры
&НаСервере
Процедура СоздатьДокументыНаСервере()
	
	СуммаМес = Сумма/12;
	
	счПериод = Период.ДатаНачала;
	Пока счПериод <= Период.ДатаОкончания Цикл
		
		Док = Документы.ПлановаяОперация.СоздатьДокумент();
		Док.Дата 		= счПериод;
		Док.СтатьяДДС 	= СтатьяДДС;
		Док.Сумма		= СуммаМес;
		Док.Записать(РежимЗаписиДокумента.Проведение);
		
		Если УчитыватьИнфляцию Тогда
			СуммаМес = СуммаМес+(СуммаМес*0.002466);
		КонецЕсли;	
		счПериод = ДобавитьМесяц(счПериод, 1);
		
	КонецЦикла;

КонецПроцедуры
